app/views/gossips/index.html.erb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["user_id", 364], ["user_id", 365], ["user_id", 366], ["user_id", 367], ["user_id", 368], ["user_id", 369], ["user_id", 370], ["user_id", 371], ["user_id", 372], ["user_id", 373]]
---
  <% @users.each do |user| %>
    <% if user.gossips.present? %>