app/views/gossips/new.html.erb

SELECT "users".* FROM "users"
---
    <%= label_tag :user_id, "Auteur" %>
    <%= select_tag 'gossip[user_id]', options_for_select(User.all.collect { |u| [u.first_name, u.id] }), class: "form-control" %>