app/views/gossips/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 334], ["LIMIT", 1]]
---
  <p><strong>Contenu:</strong> <%= @gossip.description%></p>
  <p><strong>Auteur:</strong> <%= link_to @gossip.user.first_name, user_path(@gossip.user) %></p>