app/views/city/index.html.erb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."city_id" = $1  [["city_id", 1]]
---
  <% @cities.each do |city| %>
    <% if city.gossips.present? %>

SELECT "gossips".* FROM "gossips" WHERE "gossips"."city_id" = $1  [["city_id", 1]]
---
        <div class="card-body">
          <% city.gossips.each do |gossip| %>