app/views/city/show.html.erb

          <p class="card-text">
            <%= "#{gossip.title} - #{gossip.user.first_name}" %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 364], ["LIMIT", 1]]