app/controllers/city_controller.rb

  def index
    first_city = City.first
    @cities = City.all
    @users = User.includes(:gossips)
---
SELECT "cities".* FROM "cities" ORDER BY "cities"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."city_id" = $1  [["city_id", 1]]

  def show
    @city = City.find(params[:id])
    @gossips = @city.gossips
    @cities = City.all
    @cities_with_gossips = City.joins(:gossips).distinct
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 177], ["LIMIT", 1]]
SELECT "cities".* FROM "cities"
SELECT DISTINCT "cities".* FROM "cities" INNER JOIN "gossips" ON "gossips"."city_id" = "cities"."id"