app/controllers/gossips_controller.rb

  def index
    @gossips = Gossip.all
    @users = User.includes(:gossips)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10)  [["user_id", 364], ["user_id", 365], ["user_id", 366], ["user_id", 367], ["user_id", 368], ["user_id", 369], ["user_id", 370], ["user_id", 371], ["user_id", 372], ["user_id", 373]]
SELECT "users".* FROM "users"

  def show
    @gossip = Gossip.find(params[:id])
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 324], ["LIMIT", 1]]

  def new
    @gossips = Gossip.all
    @gossip = Gossip.new
    @users = User.includes(:gossips)
    @cities = City.all
---
SELECT "users".* FROM "users"
SELECT "cities".* FROM "cities"

  def create
    @gossip = Gossip.new(gossip_params)
    if @gossip.save
---
INSERT INTO "gossips" ("title", "description", "user_id", "created_at", "updated_at", "city_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "banane"], ["description", "cccc"], ["user_id", 364], ["created_at", "2024-05-01 11:51:30.046458"], ["updated_at", "2024-05-01 11:51:30.046458"], ["city_id", 1]]