app/controllers/welcome_controller.rb

  def index
    @first_name = params[:first_name]
    @gossips = Gossip.all
    @users = User.includes(:gossips)
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11)  [["user_id", 21], ["user_id", 22], ["user_id", 23], ["user_id", 24], ["user_id", 25], ["user_id", 26], ["user_id", 27], ["user_id", 28], ["user_id", 29], ["user_id", 30], ["user_id", 31]]
SELECT "users".* FROM "users"